response-data-export.xsd

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body>
<p:EnergiatodistusIlmoitus xmlns:p="http://www.energiatodistusrekisteri.fi/ws/energiatodistustypes" xmlns:vakiot="http://www.energiatodistusrekisteri.fi/ws/energiatodistustypes/vakiot" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.energiatodistusrekisteri.fi/ws/energiatodistustypes ../../main/webapp/WEB-INF/wsdl/energiatodistus.xsd ">
  <p:Energiatodistus>
    <p:Perustiedot>
      <p:Nimi>EI MÄÄRITETTY</p:Nimi>
      <p:Rakennustunnus>EI MÄÄRITETTY</p:Rakennustunnus>
      <p:Katuosoite_Fi>EI MÄÄRITETTY</p:Katuosoite_Fi>
      <p:Katuosoite_Sv>EI MÄÄRITETTY</p:Katuosoite_Sv>
      <p:Postinumero>00100</p:Postinumero>
      <p:OnkoJulkinenRakennus>true</p:OnkoJulkinenRakennus>
      <p:OnkoUudisrakennus>true</p:OnkoUudisrakennus>
      <p:Rakennusosa>EI MÄÄRITETTY</p:Rakennusosa>
      <p:Valmistumisvuosi>2001</p:Valmistumisvuosi>
      <p:Kayttotarkoitus>A</p:Kayttotarkoitus>
      <p:Kieli>0</p:Kieli>
      <p:Tilaaja>EI MÄÄRITETTY</p:Tilaaja>
      <p:Yritys>			
      	<p:Nimi>EI MÄÄRITETTY</p:Nimi>		
		<p:Katuosoite>EI MÄÄRITETTY</p:Katuosoite>	
		<p:Postinumero>00100</p:Postinumero>	
      </p:Yritys>			
      <p:KeskeisetSuositukset_Fi>EI MÄÄRITETTY</p:KeskeisetSuositukset_Fi>
      <p:KeskeisetSuositukset_Sv>EI MÄÄRITETTY</p:KeskeisetSuositukset_Sv>
    </p:Perustiedot>
    <p:Lahtotiedot>
      <p:LammitettyNettoala>100.0</p:LammitettyNettoala>
      <p:LahtotiedotRakennusvaippa>
        <p:Ilmanvuotoluku>4.0</p:Ilmanvuotoluku>
        <p:RvUlkoseinat>
          <p:RvA>0.0</p:RvA>
          <p:RvU>0.5</p:RvU>
        </p:RvUlkoseinat>
        <p:RvYlapohja>
          <p:RvA>0.0</p:RvA>
          <p:RvU>0.5</p:RvU>
        </p:RvYlapohja>
        <p:RvAlapohja>
          <p:RvA>0.0</p:RvA>
          <p:RvU>0.5</p:RvU>
        </p:RvAlapohja>
        <p:RvIkkunat>
          <p:RvA>0.0</p:RvA>
          <p:RvU>0.5</p:RvU>
        </p:RvIkkunat>
        <p:RvUlkoovet>
          <p:RvA>0.0</p:RvA>
          <p:RvU>0.5</p:RvU>
        </p:RvUlkoovet>
        <p:RvKylmasillatUA>0.0</p:RvKylmasillatUA>
      </p:LahtotiedotRakennusvaippa>
      <p:LahtotiedotIkkunat>
        <p:Pohjoinen>
          <p:IkkA>0.0</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Pohjoinen>
        <p:Koillinen>
          <p:IkkA>0.0</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Koillinen>
        <p:Ita>
          <p:IkkA>0.0</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Ita>
        <p:Kaakko>
          <p:IkkA>0.0</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Kaakko>
        <p:Etela>
          <p:IkkA>0.0</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Etela>
        <p:Lounas>
          <p:IkkA>0.0</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Lounas>
        <p:Lansi>
          <p:IkkA>0.0</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Lansi>
        <p:Luode>
          <p:IkkA>0.0</p:IkkA>
          <p:IkkU>0.5</p:IkkU>
          <p:IkkG>0.5</p:IkkG>
        </p:Luode>
      </p:LahtotiedotIkkunat>
      <p:LahtotiedotIlmanvaihto>
        <p:IvKuvaus_Fi>p:IvKuvaus</p:IvKuvaus_Fi>
        <p:IvKuvaus_Sv>p:IvKuvaus</p:IvKuvaus_Sv>
        <p:IvPaaivTulo>0.0</p:IvPaaivTulo>
        <p:IvPaaivPoisto>0.0</p:IvPaaivPoisto>
        <p:IvPaaivSfp>0.0</p:IvPaaivSfp>
        <p:IvPaaivLampotilasuhde>1.0</p:IvPaaivLampotilasuhde>
        <p:IvPaaivJaatymisenesto>0.0</p:IvPaaivJaatymisenesto>
        <p:IvErillispoistotTulo>0.0</p:IvErillispoistotTulo>
        <p:IvErillispoistotPoisto>0.0</p:IvErillispoistotPoisto>
        <p:IvErillispoistotSfp>0.0</p:IvErillispoistotSfp>
        <p:IvIvjarjestelmaTulo>0.0</p:IvIvjarjestelmaTulo>
        <p:IvIvjarjestelmaPoisto>0.0</p:IvIvjarjestelmaPoisto>
        <p:IvIvjarjestelmaSfp>2.0</p:IvIvjarjestelmaSfp>
        <p:IvLtoVuosihyotysuhde>1.0</p:IvLtoVuosihyotysuhde>
      </p:LahtotiedotIlmanvaihto>
      <p:LahtotiedotLammitys>
        <p:LammitysKuvaus_Fi>p:LammitysKuvaus</p:LammitysKuvaus_Fi>
        <p:LammitysKuvaus_Sv>p:LammitysKuvaus</p:LammitysKuvaus_Sv>
        <p:LammitysTilatJaIv>
          <p:TuotonHyotysuhde>1.0</p:TuotonHyotysuhde>
          <p:JaonHyotysuhde>1.0</p:JaonHyotysuhde>
          <p:Lampokerroin>1.0</p:Lampokerroin>
          <p:Apulaitteet>0.0</p:Apulaitteet>
        </p:LammitysTilatJaIv>
        <p:LammitysLamminKayttovesi>
          <p:TuotonHyotysuhde>1.0</p:TuotonHyotysuhde>
          <p:JaonHyotysuhde>1.0</p:JaonHyotysuhde>
          <p:Lampokerroin>1.0</p:Lampokerroin>
          <p:Apulaitteet>0.0</p:Apulaitteet>
        </p:LammitysLamminKayttovesi>
        <p:LammitysTakka>
          <p:Maara>1</p:Maara>
          <p:Tuotto>0.0</p:Tuotto>
        </p:LammitysTakka>
        <p:LammitysIlmanlampopumppu>
          <p:Maara>1</p:Maara>
          <p:Tuotto>0.0</p:Tuotto>
        </p:LammitysIlmanlampopumppu>
      </p:LahtotiedotLammitys>
      <p:LahtotiedotJaahdytysjarjestelma>
        <p:JaahdytysjarjestelmaJaahdytyskaudenPainotettuKylmakerroin>8.5</p:JaahdytysjarjestelmaJaahdytyskaudenPainotettuKylmakerroin>
      </p:LahtotiedotJaahdytysjarjestelma>
      <p:LahtotiedotLkvnKaytto>
        <p:LkvnKayttoKulutusPerNelio>0.5</p:LkvnKayttoKulutusPerNelio>
        <p:LkvnKayttoVuosikulutus>0.5</p:LkvnKayttoVuosikulutus>
      </p:LahtotiedotLkvnKaytto>
      <p:LahtotiedotSisKuormat>
        <p:SisKuorma>
          <p:Selite_Fi>Henkilöt ja kuluttajalaitteet</p:Selite_Fi>
          <p:Selite_Sv>Personer och konsumentutr.</p:Selite_Sv>
          <p:Kayttoaste>0.6</p:Kayttoaste>
          <p:Henkilot>2.0</p:Henkilot>
          <p:Kuluttajalaitteet>3.0</p:Kuluttajalaitteet>
        </p:SisKuorma>
        <p:SisKuorma>
          <p:Selite_Fi>Valaistus</p:Selite_Fi>
          <p:Selite_Sv>Belysning</p:Selite_Sv>
          <p:Kayttoaste>0.1</p:Kayttoaste>
          <p:Valaistus>8.0</p:Valaistus>
        </p:SisKuorma>
      </p:LahtotiedotSisKuormat>
    </p:Lahtotiedot>
    <p:Tulokset>
      <p:TuloksetKaytettavatEnergiamuodot>
        <p:KaytettavaEnergiamuoto>
		  <p:EnergiamuotoVakio>sähkö</p:EnergiamuotoVakio>
          <p:LaskettuOstoenergia>0.0</p:LaskettuOstoenergia>
        </p:KaytettavaEnergiamuoto>
        <p:KaytettavaEnergiamuoto>
		  <p:EnergiamuotoVakio>kaukolämpö</p:EnergiamuotoVakio>
          <p:LaskettuOstoenergia>0.0</p:LaskettuOstoenergia>
        </p:KaytettavaEnergiamuoto>
        <p:KaytettavaEnergiamuoto>
		  <p:EnergiamuotoVapaa>Uusiutuva polttoaine (Puu)</p:EnergiamuotoVapaa>
		  <p:EnergiamuodonKerroin>0.5</p:EnergiamuodonKerroin>
          <p:LaskettuOstoenergia>0.0</p:LaskettuOstoenergia>
        </p:KaytettavaEnergiamuoto>
        <p:KaytettavaEnergiamuoto>
		  <p:EnergiamuotoVapaa>Fossiilinen polttoaine (Öljy)</p:EnergiamuotoVapaa>
		  <p:EnergiamuodonKerroin>1.0</p:EnergiamuodonKerroin>
          <p:LaskettuOstoenergia>0.0</p:LaskettuOstoenergia>
        </p:KaytettavaEnergiamuoto>
        <p:KaytettavaEnergiamuoto>
		  <p:EnergiamuotoVapaa>Fossiilinen polttoaine (Kaasu)</p:EnergiamuotoVapaa>
		  <p:EnergiamuodonKerroin>1.0</p:EnergiamuodonKerroin>
          <p:LaskettuOstoenergia>0.0</p:LaskettuOstoenergia>
        </p:KaytettavaEnergiamuoto>
        <p:KaytettavaEnergiamuoto>
		  <p:EnergiamuotoVakio>kaukojäähdytys</p:EnergiamuotoVakio>
         <p:LaskettuOstoenergia>0.0</p:LaskettuOstoenergia>
        </p:KaytettavaEnergiamuoto>
      </p:TuloksetKaytettavatEnergiamuodot>
      <p:TuloksetUusiutuvatOmavaraisenergiat>
        <p:UusiutuvaOmavaraisenergia>
          <p:Nimi>Aurinkokeräimet</p:Nimi>
          <p:Vuosikulutus>0.0</p:Vuosikulutus>
        </p:UusiutuvaOmavaraisenergia>
        <p:UusiutuvaOmavaraisenergia>
          <p:Nimi>Aurinkokennot/tuulivoima</p:Nimi>
          <p:Vuosikulutus>0.0</p:Vuosikulutus>
        </p:UusiutuvaOmavaraisenergia>
        <p:UusiutuvaOmavaraisenergia>
          <p:Nimi>Maalämpö</p:Nimi>
          <p:Vuosikulutus>0.0</p:Vuosikulutus>
        </p:UusiutuvaOmavaraisenergia>
        <p:UusiutuvaOmavaraisenergia>
          <p:Nimi>Lämpö ulkoilmasta</p:Nimi>
          <p:Vuosikulutus>0.0</p:Vuosikulutus>
        </p:UusiutuvaOmavaraisenergia>
      </p:TuloksetUusiutuvatOmavaraisenergiat>
      <p:TuloksetTeknisetJarjestelmat>
        <p:TjTilojenLammitys xsi:type="p:LammitysSahkoLampoType">
          <p:Sahko>0.0</p:Sahko>
          <p:Lampo>0.0</p:Lampo>
        </p:TjTilojenLammitys>
        <p:TjTuloilmanLammitys xsi:type="p:LammitysSahkoLampoType">
          <p:Sahko>0.0</p:Sahko>
          <p:Lampo>0.0</p:Lampo>
        </p:TjTuloilmanLammitys>
        <p:TjKayttovedenValmistus>
          <p:Sahko>0.0</p:Sahko>
          <p:Lampo>0.0</p:Lampo>
        </p:TjKayttovedenValmistus>
        <p:TjIvSahko>0.0</p:TjIvSahko>
        <p:TjJaahdytys>
          <p:Sahko>0.0</p:Sahko>
          <p:Lampo>0.0</p:Lampo>
          <p:Kaukojaahdytys>0.0</p:Kaukojaahdytys>
        </p:TjJaahdytys>
        <p:TjKuluttajalaitteetJaValaistusSahko>0.0</p:TjKuluttajalaitteetJaValaistusSahko>
      </p:TuloksetTeknisetJarjestelmat>
      <p:TuloksetNettotarve>
        <p:NtTilojenLammitysVuosikulutus>0.0</p:NtTilojenLammitysVuosikulutus>
        <p:NtIlmanvaihdonLammitysVuosikulutus>0.0</p:NtIlmanvaihdonLammitysVuosikulutus>
        <p:NtKayttovedenValmistusVuosikulutus>0.0</p:NtKayttovedenValmistusVuosikulutus>
        <p:NtJaahdytysVuosikulutus>0.0</p:NtJaahdytysVuosikulutus>
      </p:TuloksetNettotarve>
      <p:TuloksetLampokuormat>
        <p:LkAurinko>0.0</p:LkAurinko>
        <p:LkIhmiset>0.0</p:LkIhmiset>
        <p:LkKuluttajalaitteet>0.0</p:LkKuluttajalaitteet>
        <p:LkValaistus>0.0</p:LkValaistus>
        <p:LkKvesi>0.0</p:LkKvesi>
      </p:TuloksetLampokuormat>
      <p:TuloksetLaskentatyokalu>p:TuloksetLaskentatyokalu</p:TuloksetLaskentatyokalu>
    </p:Tulokset>
    <p:ToteutunutOstoenergiankulutus>
      <p:OstettuEnergia>
        <p:ToKaukolampoVuosikulutus>0.0</p:ToKaukolampoVuosikulutus>
        <p:ToKokonaissahkoVuosikulutus>0.0</p:ToKokonaissahkoVuosikulutus>
        <p:ToKiinteistosahkoVuosikulutus>0.0</p:ToKiinteistosahkoVuosikulutus>
        <p:ToKayttajasahkoVuosikulutus>0.0</p:ToKayttajasahkoVuosikulutus>
        <p:ToKaukojaahdytysVuosikulutus>0.0</p:ToKaukojaahdytysVuosikulutus>
        <p:ToVapaa>
          <p:Nimi>p:Nimi</p:Nimi>
          <p:Vuosikulutus>0.0</p:Vuosikulutus>
        </p:ToVapaa>
      </p:OstettuEnergia>
      <p:OstetutPolttoaineet>
        <p:OpVapaa>
          <p:OpNimi>Raskas polttoöljy</p:OpNimi>
          <p:OpYksikko>kg</p:OpYksikko>
          <p:OpMuunnoskerroin>11.4</p:OpMuunnoskerroin>
          <p:OpMaaraVuodessa>0.0</p:OpMaaraVuodessa>
        </p:OpVapaa>
        <p:OpVapaa>
          <p:OpNimi>Kevyt polttoöljy</p:OpNimi>
          <p:OpYksikko>dm3</p:OpYksikko>
          <p:OpMuunnoskerroin>10</p:OpMuunnoskerroin>
          <p:OpMaaraVuodessa>0.0</p:OpMaaraVuodessa>
        </p:OpVapaa>
       <p:OpVapaa>
          <p:OpNimi>Maakaasu</p:OpNimi>
          <p:OpYksikko>m3n</p:OpYksikko>
          <p:OpMuunnoskerroin>10.0</p:OpMuunnoskerroin>
          <p:OpMaaraVuodessa>0.0</p:OpMaaraVuodessa>
        </p:OpVapaa>
       <p:OpVapaa>
          <p:OpNimi>Polttopuu</p:OpNimi>
          <p:OpYksikko>kg</p:OpYksikko>
          <p:OpMuunnoskerroin>4.1</p:OpMuunnoskerroin>
          <p:OpMaaraVuodessa>0.0</p:OpMaaraVuodessa>
        </p:OpVapaa>
       <p:OpVapaa>
          <p:OpNimi>Pilkkeet</p:OpNimi>
          <p:OpYksikko>pino-m3</p:OpYksikko>
          <p:OpMuunnoskerroin>1300</p:OpMuunnoskerroin>
          <p:OpMaaraVuodessa>0.0</p:OpMaaraVuodessa>
        </p:OpVapaa>
       <p:OpVapaa>
          <p:OpNimi>Polttohake</p:OpNimi>
          <p:OpYksikko>irto-m3</p:OpYksikko>
          <p:OpMuunnoskerroin>900</p:OpMuunnoskerroin>
          <p:OpMaaraVuodessa>0.0</p:OpMaaraVuodessa>
        </p:OpVapaa>
     </p:OstetutPolttoaineet>
      <p:ToSahkoVuosikulutusYhteensa>0.0</p:ToSahkoVuosikulutusYhteensa>
      <p:ToKaukolampoVuosikulutusYhteensa>0.0</p:ToKaukolampoVuosikulutusYhteensa>
      <p:ToPolttoaineetVuosikulutusYhteensa>0.0</p:ToPolttoaineetVuosikulutusYhteensa>
      <p:ToKaukojaahdytysVuosikulutusYhteensa>0.0</p:ToKaukojaahdytysVuosikulutusYhteensa>
    </p:ToteutunutOstoenergiankulutus>
    <p:Huomiot>
      <p:HuomiotYmparys>
        <p:HuomiotTeksti_Fi>p:HuomiotTeksti</p:HuomiotTeksti_Fi>
        <p:HuomiotTeksti_Sv>p:HuomiotTeksti</p:HuomiotTeksti_Sv>
       <p:Toimenpide>
          <p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Nimi_Sv>p:Nimi</p:Nimi_Sv>
          <p:Lampo>0.0</p:Lampo>
          <p:Sahko>0.0</p:Sahko>
          <p:Jaahdytys>0.0</p:Jaahdytys>
          <p:EluvunMuutos>0.0</p:EluvunMuutos>
        </p:Toimenpide>
        <p:Toimenpide>
          <p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Nimi_Sv>p:Nimi</p:Nimi_Sv>
          <p:Lampo>0.0</p:Lampo>
          <p:Sahko>0.0</p:Sahko>
          <p:Jaahdytys>0.0</p:Jaahdytys>
          <p:EluvunMuutos>0.0</p:EluvunMuutos>
        </p:Toimenpide>
        <p:Toimenpide>
          <p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Nimi_Sv>p:Nimi</p:Nimi_Sv>
          <p:Lampo>0.0</p:Lampo>
          <p:Sahko>0.0</p:Sahko>
          <p:Jaahdytys>0.0</p:Jaahdytys>
          <p:EluvunMuutos>0.0</p:EluvunMuutos>
        </p:Toimenpide>
      </p:HuomiotYmparys>
      <p:HuomiotAlapohjaYlapohja>
        <p:HuomiotTeksti_Fi>p:HuomiotTeksti</p:HuomiotTeksti_Fi>
        <p:HuomiotTeksti_Sv>p:HuomiotTeksti</p:HuomiotTeksti_Sv>
        <p:Toimenpide>
          <p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Nimi_Sv>p:Nimi</p:Nimi_Sv>
          <p:Lampo>0.0</p:Lampo>
          <p:Sahko>0.0</p:Sahko>
          <p:Jaahdytys>0.0</p:Jaahdytys>
          <p:EluvunMuutos>0.0</p:EluvunMuutos>
        </p:Toimenpide>
         <p:Toimenpide>
          <p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Nimi_Sv>p:Nimi</p:Nimi_Sv>
          <p:Lampo>0.0</p:Lampo>
          <p:Sahko>0.0</p:Sahko>
          <p:Jaahdytys>0.0</p:Jaahdytys>
          <p:EluvunMuutos>0.0</p:EluvunMuutos>
        </p:Toimenpide>
        <p:Toimenpide>
          <p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Nimi_Sv>p:Nimi</p:Nimi_Sv>
          <p:Lampo>0.0</p:Lampo>
          <p:Sahko>0.0</p:Sahko>
          <p:Jaahdytys>0.0</p:Jaahdytys>
          <p:EluvunMuutos>0.0</p:EluvunMuutos>
        </p:Toimenpide>
     </p:HuomiotAlapohjaYlapohja>
      <p:HuomiotLammitys>
        <p:HuomiotTeksti_Fi>p:HuomiotTeksti</p:HuomiotTeksti_Fi>
        <p:HuomiotTeksti_Sv>p:HuomiotTeksti</p:HuomiotTeksti_Sv>
        <p:Toimenpide>
          <p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Nimi_Sv>p:Nimi</p:Nimi_Sv>
          <p:Lampo>0.0</p:Lampo>
          <p:Sahko>0.0</p:Sahko>
          <p:Jaahdytys>0.0</p:Jaahdytys>
          <p:EluvunMuutos>0.0</p:EluvunMuutos>
        </p:Toimenpide>
        <p:Toimenpide>
          <p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Nimi_Sv>p:Nimi</p:Nimi_Sv>
          <p:Lampo>0.0</p:Lampo>
          <p:Sahko>0.0</p:Sahko>
          <p:Jaahdytys>0.0</p:Jaahdytys>
          <p:EluvunMuutos>0.0</p:EluvunMuutos>
        </p:Toimenpide>
        <p:Toimenpide>
          <p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Nimi_Sv>p:Nimi</p:Nimi_Sv>
          <p:Lampo>0.0</p:Lampo>
          <p:Sahko>0.0</p:Sahko>
          <p:Jaahdytys>0.0</p:Jaahdytys>
          <p:EluvunMuutos>0.0</p:EluvunMuutos>
        </p:Toimenpide>
      </p:HuomiotLammitys>
      <p:HuomiotIvIlmastointi>
        <p:HuomiotTeksti_Fi>p:HuomiotTeksti</p:HuomiotTeksti_Fi>
        <p:HuomiotTeksti_Sv>p:HuomiotTeksti</p:HuomiotTeksti_Sv>
        <p:Toimenpide>
          <p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Nimi_Sv>p:Nimi</p:Nimi_Sv>
          <p:Lampo>0.0</p:Lampo>
          <p:Sahko>0.0</p:Sahko>
          <p:Jaahdytys>0.0</p:Jaahdytys>
          <p:EluvunMuutos>0.0</p:EluvunMuutos>
        </p:Toimenpide>
         <p:Toimenpide>
          <p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Nimi_Sv>p:Nimi</p:Nimi_Sv>
          <p:Lampo>0.0</p:Lampo>
          <p:Sahko>0.0</p:Sahko>
          <p:Jaahdytys>0.0</p:Jaahdytys>
          <p:EluvunMuutos>0.0</p:EluvunMuutos>
        </p:Toimenpide>
        <p:Toimenpide>
          <p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Nimi_Sv>p:Nimi</p:Nimi_Sv>
          <p:Lampo>0.0</p:Lampo>
          <p:Sahko>0.0</p:Sahko>
          <p:Jaahdytys>0.0</p:Jaahdytys>
          <p:EluvunMuutos>0.0</p:EluvunMuutos>
        </p:Toimenpide>
     </p:HuomiotIvIlmastointi>
      <p:HuomiotValaistusMuut>
        <p:HuomiotTeksti_Fi>p:HuomiotTeksti</p:HuomiotTeksti_Fi>
        <p:HuomiotTeksti_Sv>p:HuomiotTeksti</p:HuomiotTeksti_Sv>
        <p:Toimenpide>
          <p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Nimi_Sv>p:Nimi</p:Nimi_Sv>
          <p:Lampo>0.0</p:Lampo>
          <p:Sahko>0.0</p:Sahko>
          <p:Jaahdytys>0.0</p:Jaahdytys>
          <p:EluvunMuutos>0.0</p:EluvunMuutos>
        </p:Toimenpide>
         <p:Toimenpide>
          <p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Nimi_Sv>p:Nimi</p:Nimi_Sv>
          <p:Lampo>0.0</p:Lampo>
          <p:Sahko>0.0</p:Sahko>
          <p:Jaahdytys>0.0</p:Jaahdytys>
          <p:EluvunMuutos>0.0</p:EluvunMuutos>
        </p:Toimenpide>
        <p:Toimenpide>
          <p:Nimi_Fi>p:Nimi</p:Nimi_Fi>
          <p:Nimi_Sv>p:Nimi</p:Nimi_Sv>
          <p:Lampo>0.0</p:Lampo>
          <p:Sahko>0.0</p:Sahko>
          <p:Jaahdytys>0.0</p:Jaahdytys>
          <p:EluvunMuutos>0.0</p:EluvunMuutos>
        </p:Toimenpide>
     </p:HuomiotValaistusMuut>
      <p:HuomiotSuositukset_Fi>p:HuomiotSuositukset</p:HuomiotSuositukset_Fi>
      <p:HuomiotSuositukset_Sv>p:HuomiotSuositukset</p:HuomiotSuositukset_Sv>
      <p:HuomiotLisatietoja_Fi>p:HuomiotLisatietoja</p:HuomiotLisatietoja_Fi>
      <p:HuomiotLisatietoja_Sv>p:HuomiotLisatietoja</p:HuomiotLisatietoja_Sv>
    </p:Huomiot>
    <p:Lisamerkintoja_Fi>p:Lisamerkintoja</p:Lisamerkintoja_Fi>
    <p:Lisamerkintoja_Sv>p:Lisamerkintoja</p:Lisamerkintoja_Sv>
  </p:Energiatodistus>
</p:EnergiatodistusIlmoitus>
</S:Body></S:Envelope>